---
type: InCanvasControlData
namespace: Autodesk.Revit.DB
version: 2024
members: 5
tags: [revit-api, class]
---

# InCanvasControlData

`Autodesk.Revit.DB.InCanvasControlData` · Revit 2024 · 5 members

| Kind | Member | Since | Signature |
| --- | --- | --- | --- |
| Constructor | InCanvasControlData | — | `` |
| Method | Dispose | — | `public void Dispose ()` |
| Property | ImagePath | 2022 | `public string ImagePath { get ; set ; }` |
| Property | IsValidObject | 2014 | `public bool IsValidObject { get ; }` |
| Property | Position | 2022 | `public XYZ Position { get ; set ; }` |